CSI API ETABS v1
cPropLink.GetPDelta Method
 retrieves P-delta parameters for a link property.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPDelta(
	string Name,
	ref double[] Value
)
Function GetPDelta (
	Name As String,
	ByRef Value As Double()
) As Integer
Dim instance As cPropLink
Dim Name As String
Dim Value As Double()
Dim returnValue As Integer
returnValue = instance.GetPDelta(Name,
	Value)
int GetPDelta(
	String^ Name,
	array<double>^% Value
)
abstract GetPDelta :
        Name : string *
        Value : float[] byref -> int
Parameters
Name
Type: System.String
The name of an existing link property.
Value
Type: System.Double[]
This is an array of P-delta parameters
Value | PDelta Parameter
Value(0) | M2 P-delta to I-end of link as moment, M2I
Value(1) | M2 P-delta to J-end of link as moment, M2J
Value(2) | M3 P-delta to I-end of link as moment, M3I
Value(3) | M3 P-delta to J-end of link as moment, M3J
Return Value
Type: Int32
Returns zero if the values are successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim DOF() As Boolean
       Dim Fixed() As Boolean
       Dim Ke() As Double
       Dim Ce() As Double
       Dim MyValue() As Double
       Dim Value() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link property
       ReDim DOF(5)
       ReDim Fixed(5)
       ReDim Ke(5)
       ReDim Ce(5)
       DOF(0) = True
       Ke(0) = 12
       ret = SapModel.PropLink.SetLinear("L1", DOF, Fixed, Ke, Ce, 0, 0)
   'set link property P-delta parameters
       ReDim MyValue(3)
       MyValue(0) = 0.6
       MyValue(1) = 0.4
       MyValue(2) = 0.3
       MyValue(3) = 0.2
       ret = SapModel.PropLink.SetPDelta("L1", MyValue)
   'get link property P-delta parameters
       ret = SapModel.PropLink.GetPDelta("L1", Value)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropLink Interface
ETABSv1 Namespace